eisup_2019_docmng_integration/src/Reports/ДанныеДляКарточкиУчетаОрганизацииВВоенкомате/ДанныеДляКарточкиУчетаОрганизацииВВоенкомате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДанныеДляКарточкиУчетаОрганизацииВВоенкомате</name>
  <attributes>
    <name>РасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтрицательноеКрасным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияНастроекПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПараметрыПанелиПользователя</name>
  </attributes>
  <attributes>
    <name>ПредставлениеЭлементаОтчета</name>
    <type>
      <types>EnumRef.ПредставленияЭлементовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Расшифровки</name>
  </attributes>
</mdclass:Report>

eisup_2019_docmng_integration/src/Enums/ГодностьКВоеннойСлужбе/ГодностьКВоеннойСлужбе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГодностьКВоеннойСлужбе</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Годен</name>
  </enumValues>
  <enumValues>
    <name>ГоденСОграничениями</name>
  </enumValues>
  <enumValues>
    <name>ОграниченноГоден</name>
  </enumValues>
  <enumValues>
    <name>ВременноНеГоден</name>
  </enumValues>
  <enumValues>
    <name>НеГоден</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ЗваниеГражданскогоВоинскогоУчета/ЗваниеГражданскогоВоинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗваниеГражданскогоВоинскогоУчета</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>ГенералАрмии</name>
      <description>Генерал армии</description>
    </items>
    <items>
      <name>ГенералЛейтенант</name>
      <description>Генерал-лейтенант</description>
    </items>
    <items>
      <name>ГенералМайор</name>
      <description>Генерал-майор</description>
    </items>
    <items>
      <name>ГенералПолковник</name>
      <description>Генерал-полковник</description>
    </items>
    <items>
      <name>Ефрейтор</name>
      <description>Ефрейтор</description>
    </items>
    <items>
      <name>Капитан</name>
      <description>Капитан</description>
    </items>
    <items>
      <name>Лейтенант</name>
      <description>Лейтенант</description>
    </items>
    <items>
      <name>Майор</name>
      <description>Майор</description>
    </items>
    <items>
      <name>МаршалРоссийскойФедерации</name>
      <description>Маршал Российской Федерации</description>
    </items>
    <items>
      <name>МладшийЛейтенант</name>
      <description>Младший лейтенант</description>
    </items>
    <items>
      <name>МладшийСержант</name>
      <description>Младший сержант</description>
    </items>
    <items>
      <name>Подполковник</name>
      <description>Подполковник</description>
    </items>
    <items>
      <name>Полковник</name>
      <description>Полковник</description>
    </items>
    <items>
      <name>Прапорщик</name>
      <description>Прапорщик</description>
    </items>
    <items>
      <name>Рядовой</name>
      <description>Рядовой</description>
    </items>
    <items>
      <name>Сержант</name>
      <description>Сержант</description>
    </items>
    <items>
      <name>СтаршийЛейтенант</name>
      <description>Старший лейтенант</description>
    </items>
    <items>
      <name>СтаршийПрапорщик</name>
      <description>Старший прапорщик</description>
    </items>
    <items>
      <name>СтаршийСержант</name>
      <description>Старший сержант</description>
    </items>
    <items>
      <name>Старшина</name>
      <description>Старшина</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбщевойсковоеЗвание</name>
    <type>
      <types>CatalogRef.ЗваниеГражданскогоВоинскогоУчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Reports/ДанныеДляКарточкиУчетаОрганизацииВВоенкомате/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю
	
Функция СформироватьОтчет(Результат, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
		
	ЗначениеПанелипользователя = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ЭтотОбъект);
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	
	СписокОфицерскихЗваний	=	Новый СписокЗначений;
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.МладшийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Лейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.СтаршийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Капитан);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Майор);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Подполковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Полковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералМайор);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералПолковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.ГенералАрмии);
	СписокОфицерскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.МаршалРоссийскойФедерации);
	
	СписокЗванийПрапорщиков	=	Новый СписокЗначений;
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Прапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.СтаршийПрапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.МладшийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Сержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.СтаршийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Старшина);
	
	СписокСолдатскихЗваний	=	Новый СписокЗначений;
	СписокСолдатскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Рядовой);
	СписокСолдатскихЗваний.Добавить(Справочники.ЗваниеГражданскогоВоинскогоУчета.Ефрейтор);
	
	СписокГодныеКСлужбе = Новый СписокЗначений;
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.Годен);
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ГоденСОграничениями);
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ОграниченноГоден);
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Офицеры",             СписокОфицерскихЗваний);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Прапорщики",          СписокЗванийПрапорщиков);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "Солдаты",			 СписокСолдатскихЗваний);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "СписокГодныеКСлужбе", СписокГодныеКСлужбе);
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроек, "Организация", );
	
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ВсегоВЗапасе");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ВсегоВЗапасеЗабронировано");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ВсегоРаботающих");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "НегодныхВМирноеВремя");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "НезабронированноБезМобпредписаний");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "НезабронированноСМобпредписанием");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ОфицеровВЗапасе");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ОфицеровЗабронировано");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ПрапорщиковВЗапасе");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "Призывников");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "СолдатВЗапасе");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаЗначений =  Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ЗначениеПараметра <> Неопределено тогда
		Если Дата(ЗначениеПараметра.Значение) <> '00010101' тогда
			ДатаАктуальности = Дата(ЗначениеПараметра.Значение);
		Иначе
			ДатаАктуальности           = ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
			ЗначениеПараметра.Значение = ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
		КонецЕсли;
	Иначе
		ДатаАктуальности = ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
	КонецЕсли;
	
	//ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
	//Возврат Результат;
	Макет = ПолучитьМакет("КарточкаУчета");
	Результат.Очистить();
	Для каждого ДанныеОрганизации из ТаблицаЗначений Цикл
		ОбластьКарточка1 	= Макет.ПолучитьОбласть("Лист1Карточки");
		ОбластьКарточка1.Параметры.ДатаОтчета 			= Формат(ДатаАктуальности, "ДФ='дд ММММ гггг'");
		ОбластьКарточка1.Параметры.НазваниеОрганизации	= ДанныеОрганизации.Организация.НаименованиеПолное;
		СтруктураОтветственныхЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(ДанныеОрганизации.Организация,ДатаАктуальности,"");
		//ОбластьКарточка1.Параметры.ДолжностьРуководителя	= СтруктураОтветственныхЛиц.РуководительДолжность;
		ОбластьКарточка1.Параметры.ФИОРуководителя		= СтруктураОтветственныхЛиц.Руководитель;
		ОбластьКарточка1.Параметры.ЮридическийАдрес		= УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(ДанныеОрганизации.Организация,"Юридический");
		ОбластьКарточка1.Параметры.ФактическийАдрес		= УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(ДанныеОрганизации.Организация,"Фактический");
		ОбластьКарточка1.Параметры.КодПоОКАТО			= ДанныеОрганизации.Организация.КодПоОКАТО;
		ОбластьКарточка1.Параметры.КодПоОКПО			= ДанныеОрганизации.Организация.КодПоОКПО;
		ОбластьКарточка1.Параметры.НаименованиеОКОПФ	= ДанныеОрганизации.Организация.НаименованиеОКОПФ;
		ОбластьКарточка1.Параметры.КодОКОПФ				= ДанныеОрганизации.Организация.КодОКОПФ;
		ОбластьКарточка1.Параметры.НаименованиеОКФС		= ДанныеОрганизации.Организация.НаименованиеОКФС;
		ОбластьКарточка1.Параметры.КодОКФС				= ДанныеОрганизации.Организация.КодОКФС;
		ОбластьКарточка1.Параметры.КодОКВЭД				= ""+ ДанныеОрганизации.Организация.НаименованиеОКВЭД + " (" + ДанныеОрганизации.Организация.КодОКВЭД + ") ";
		ОбластьКарточка1.Параметры.ИНН					= ДанныеОрганизации.Организация.ИНН;
		Если ТипЗнч(ОбластьКарточка1)	=	Тип("ТабличныйДокумент")	тогда
			Результат.Присоединить(ОбластьКарточка1);
		КонецЕсли;
		ОбластьКарточка2 	= Макет.ПолучитьОбласть("Лист2Карточки");
		ОбластьКарточка2.Параметры.ВсегоРаботающих						= ДанныеОрганизации.ВсегоРаботающих;
		ОбластьКарточка2.Параметры.ВсегоВЗапасе 						= ДанныеОрганизации.ВсегоВЗапасе;
		ОбластьКарточка2.Параметры.ОфицеровВЗапасе 						= ДанныеОрганизации.ОфицеровВЗапасе;
		ОбластьКарточка2.Параметры.ПрапорщиковВЗапасе 					= ДанныеОрганизации.ПрапорщиковВЗапасе;
		ОбластьКарточка2.Параметры.СолдатВЗапасе 						= ДанныеОрганизации.СолдатВЗапасе;
		ОбластьКарточка2.Параметры.НегодныхВМирноеВремя 				= ДанныеОрганизации.НегодныхВМирноеВремя;
		//ОбластьКарточка2.Параметры.ВсегоВЗапасеЗабронировано 			= "12.2. Забронировано всего:  " + ВыборкаПоКатегориям.ВсегоВЗапасеЗабронировано	+	", в том числе офицеров и генералов  " + ВыборкаПоКатегориям.ОфицеровЗабронировано;
		ОбластьКарточка2.Параметры.НезабронированноБезМобпредписаний 	= ДанныеОрганизации.НезабронированноБезМобпредписаний;
		//ОбластьКарточка2.Параметры.НезабронированноСМобпредписанием	= ВыборкаПоКатегориям.НезабронированноСМобпредписанием;
		ОбластьКарточка2.Параметры.Призывников							= ДанныеОрганизации.Призывников;
		Если ТипЗнч(ОбластьКарточка2)	=	Тип("ТабличныйДокумент")	тогда
			Результат.Присоединить(ОбластьКарточка2);
		КонецЕсли;
		Если ТаблицаЗначений.Индекс(ДанныеОрганизации) <> ТаблицаЗначений.Количество()-1 тогда
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла;
	
	//Параметры документа
	Результат.Автомасштаб		 = Истина;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Результат.Защита             = Ложь;
	Результат.ТолькоПросмотр     = Ложь;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	Возврат Результат;
		
КонецФункции

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

Процедура ПередВыводомЭлементРезультата(МакетКомпоновки, ПроцессорКомпоновки, ЭлементРезультата) Экспорт
	
КонецПроцедуры

Процедура ПередВыводомОтчета(МакетКомпоновки, ПроцессорКомпоновки) Экспорт
	
	
КонецПроцедуры

Процедура ПриВыводеЗаголовкаОтчета(ОбластьЗаголовок) Экспорт
КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СписокПолейПодстановкиОтборовПоУмолчанию = Новый Соответствие;
	СписокПолейПодстановкиОтборовПоУмолчанию.Вставить("Организация", "ОсновнаяОрганизация");
	
	Возврат Новый Структура("ИспользоватьСобытияПриФормированииОтчета,
	|ПриВыводеЗаголовкаОтчета,
	|ПослеВыводаПанелиПользователя,
	|ПослеВыводаПериода,
	|ПослеВыводаПараметра,
	|ПослеВыводаГруппировки,
	|ПослеВыводаОтбора,
	|ДействияПанелиИзменениеФлажкаДопНастроек,
	|ПриПолучениеНастроекПользователя, 
	|ЗаполнитьОтборыПоУмолчанию, 
	|СписокПолейПодстановкиОтборовПоУмолчанию", 
	ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, истина, СписокПолейПодстановкиОтборовПоУмолчанию);
КонецФункции

#Если Клиент Тогда
	
// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецЕсли

Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
КонецПроцедуры

Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;

Если КомпоновщикНастроек = Неопределено Тогда
	КомпоновщикНастроек =  Новый КомпоновщикНастроекКомпоновкиДанных;
КонецЕсли;

УправлениеОтчетами.ЗаменитьНазваниеПолейСхемыКомпоновкиДанных(СхемаКомпоновкиДанных)
